<?php
/**
 * WBCE CMS
 * Way Better Content Editing.
 * Visit https://wbce.org to learn more and to join the community.
 *
 * @copyright Ryan Djurovich (2004-2009)
 * @copyright WebsiteBaker Org. e.V. (2009-2015)
 * @copyright WBCE Project (2015-)
 * @license GNU GPL2 (or any later version)
 */

// RUSSIAN Modul description
$module_description = 'Этот модуль позволяет вставлять ссылку в меню.';

// Headings and text outputs
$MOD_MENU_LINK['INTERNAL_LINK'] = 'Внутренняя ссылка';
$MOD_MENU_LINK['EXTERNAL_LINK'] = 'Внешняя ссылка';
$MOD_MENU_LINK['R_TYPE'] = 'Тип перенаправления';
$MOD_MENU_LINK['R-301'] = '301 Постоянное перенаправление';
$MOD_MENU_LINK['R-302'] = '301 Временное перенаправление';
$MOD_MENU_LINK['R-200'] = '200 OK - Без перенаправления';
$MOD_MENU_LINK['TEXT'] = 'Перевод строки на русский язык';



$MOD_MENU_LINK['R-301-INFO'] = '«Постоянное перенаправление» означает, что запрашиваемый ресурс был постоянно перемещен на новое местоположение.';
$MOD_MENU_LINK['R-302-INFO'] = '«Временное перенаправление» означает, что запрашиваемый ресурс временно находится по другому URL.';
$MOD_MENU_LINK['R-200-INFO'] = 'Перенаправление не выполняется, и запрашиваемый ресурс успешно обрабатывается. Код статуса «200 OK» указывает, что запрашиваемый ресурс был найден и успешно обработан. Если вы используете этот код статуса для перенаправления, это означает, что исходный URL и перенаправленный URL будут возвращать одно и то же содержимое. Это может создать дублированные версии одного и того же содержимого, что может негативно сказаться на оптимизации для поисковых систем (SEO) и пользовательском опыте.';